<a href="https://colab.research.google.com/github/aditya248/Netflix-Exploratory-Data-Analysis/blob/main/BA775_TeamProject_B2T8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#BA775 - Team Project - Team 8
##*Project Proposal*

###**Summary Research for Netflix on itâ€™s library**

Our mission is to help Netflix summarize the details of their movie and TV show library to help them see trends on how their library has changed. We will also summarize Netflix materials based on popular genres and actors to compare with highest earning  and popular entertainment types so Netflix can maximize their user amount. 

**Source:**
https://www.kaggle.com/shivamb/netflix-sh

In [5]:
from google.colab import auth
auth.authenticate_user()

##**Part 1 -** Overview of Netflix Library

In [ ]:
## Average duration of movie and TV shows -Hanyu

In [40]:
%%bigquery --project=ba775-team8-b2
SELECT type,AVG(new_duration) AS average_duration FROM
(SELECT type,CAST(REPLACE(REPLACE(REPLACE(duration,'min',''),'Season',''),'s','') AS INT64) AS new_duration
FROM `ba775-team8-b2.Netflix.netflix_titles`)
GROUP BY type

      type  average_duration
0    Movie         99.307978
1  TV Show          1.775934

In [ ]:
## Overview of Rating-Hanyu

In [59]:
%%bigquery --project=ba775-team8-b2
#For TV show
SELECT rating, COUNT(rating) AS count_rating FROM `ba775-team8-b2.Netflix.netflix_titles`
WHERE type='TV Show' AND rating IS NOT NULL
GROUP BY rating
ORDER BY 2 DESC

     rating  count_rating
0     TV-MA          1018
1     TV-14           659
2     TV-PG           301
3     TV-Y7           176
4      TV-Y           163
5      TV-G            83
6        NR             5
7         R             2
8  TV-Y7-FV             1

In [58]:
%%bigquery --project=ba775-team8-b2
SELECT rating, COUNT(rating) AS count_rating FROM `ba775-team8-b2.Netflix.netflix_titles`
WHERE type='Movie' AND rating IS NOT NULL
GROUP BY rating
ORDER BY 2 DESC

      rating  count_rating
0      TV-MA          1845
1      TV-14          1272
2          R           663
3      TV-PG           505
4      PG-13           386
5         PG           247
6       TV-Y           117
7       TV-G           111
8      TV-Y7            95
9         NR            79
10         G            39
11        UR             5
12  TV-Y7-FV             5
13     NC-17             3

In [ ]:
## Movies/TV shows Released by Year -Hanyu

In [57]:
%%bigquery --project=ba775-team8-b2
SELECT release_year, COUNT(release_year) AS movie_added FROM `ba775-team8-b2.Netflix.netflix_titles`
GROUP BY release_year
ORDER BY release_year

    release_year  movie_added
0           1925            1
1           1942            2
2           1943            3
3           1944            3
4           1945            3
..           ...          ...
68          2017         1012
69          2018         1121
70          2019          996
71          2020          868
72          2021           31

[73 rows x 2 columns]

In [ ]:
## Popular Directors in Netflix -Hanyu

In [68]:
%%bigquery --project=ba775-team8-b2
SELECT director, COUNT(director) AS time_appeared
FROM `ba775-team8-b2.Netflix.netflix_titles`
WHERE director IS NOT NULL
GROUP BY 1
ORDER BY 2 DESC

                        director  time_appeared
0         RaÃºl Campos, Jan Suter             18
1                   Marcus Raboy             16
2                      Jay Karas             14
3            Cathy Garcia-Molina             13
4                Martin Scorsese             12
...                          ...            ...
4044     Max Lang, Jani Lachauer              1
4045  Joe Murray, Cosmo Segurson              1
4046               Joel Crawford              1
4047                 Mario Cambi              1
4048                 Suhas Kadav              1

[4049 rows x 2 columns]

##**Part 2 -** Netflix Movies

In [ ]:
## INNER JOIN two dataset and find out the top 10 rating movies

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT n.title, n.director, n.country, n.date_added, r.Rating
FROM `ba775-team8-b2.Netflix.netflix_titles` as n
INNER JOIN `ba775-team8-b2.Netflix.IMBd_movies_ratings` as r
   ON lower(n.title) = lower(r.title)
ORDER BY r.Rating DESC
LIMIT 10

                  title  ... Rating
0             Inception  ...    8.8
1                Dangal  ...    8.8
2      The Intouchables  ...    8.6
3      Taare Zameen Par  ...    8.5
4          The Departed  ...    8.5
5   The Lives of Others  ...    8.5
6              3 Idiots  ...    8.4
7      Django Unchained  ...    8.4
8  Inglourious Basterds  ...    8.3
9        Paint It Black  ...    8.3

[10 rows x 5 columns]

INNER JOIN two dataset and find out the highest grossing movie

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT n.title, n.director, n.country, n.date_added, r.Rating, r.Revenue__Millions_
FROM `ba775-team8-b2.Netflix.netflix_titles` as n
INNER JOIN `ba775-team8-b2.Netflix.IMBd_movies_ratings` as r
   ON lower(n.title) = lower(r.title)
ORDER BY r.Revenue__Millions_ DESC

                                                 title  ... Revenue__Millions_
0                                      The Jungle Book  ...             364.00
1                                         Spider-Man 3  ...             336.53
2    Indiana Jones and the Kingdom of the Crystal S...  ...             317.01
3                                            Inception  ...             292.57
4                                            Star Trek  ...             257.70
..                                                 ...  ...                ...
243                                     Paint It Black  ...                NaN
244                                    I, Daniel Blake  ...                NaN
245                                             Tramps  ...                NaN
246                            The Siege of Jadotville  ...                NaN
247                                          Good Kids  ...                NaN

[248 rows x 6 columns]

In [103]:
## Distribution of duration for Movies -Hanyu
%%bigquery --project=ba775-team8-b2
SELECT duration_range, COUNT(*) AS num_movies FROM 
(
SELECT CASE 
WHEN CAST(REPLACE(duration,'min','') AS INT64) <40 THEN '0-40'
WHEN CAST(REPLACE(duration,'min','') AS INT64) BETWEEN 40 AND 80 THEN '40-80'
WHEN CAST(REPLACE(duration,'min','') AS INT64) BETWEEN 80 AND 120 THEN '80-120'
WHEN CAST(REPLACE(duration,'min','') AS INT64) BETWEEN 120 AND 160 THEN '120-160'
WHEN CAST(REPLACE(duration,'min','') AS INT64) BETWEEN 160 AND 200 THEN '160-200'
ELSE '200+' END AS duration_range
FROM `ba775-team8-b2.Netflix.netflix_titles`
WHERE type='Movie'
)
GROUP BY duration_range
ORDER BY duration_range ###order???

  duration_range  num_movies
0           0-40         146
1        120-160         874
2        160-200         122
3           200+          15
4          40-80         848
5         80-120        3372

##**Part 3 -** Netflix TV Shows

In [ ]:
%%bigquery --ba775-team8-b2

##**Part 4 -** Trend over time

In [ ]:
%%bigquery --ba775-team8-b2

##**Part 5 -** Maximizing User Amount / Research Analysis Conclusion

In [ ]:
%%bigquery --ba775-team8-b2